In [1]:
import pandas as pd 
import numpy as np
import scipy
from scipy import stats

In [2]:
titanic = pd.read_csv("titanic.csv")
titanic.head()

,Name,PClass,Age,Sex,Survived
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0
4,"Allison, Master Hudson Trevor",1st,0.92,male,1

In [5]:
my_tab = pd.crosstab(index=titanic["Survived"], columns="count")
my_tab

col_0     count
Survived
0           863
1           450

In [6]:
survived_sex = pd.crosstab(index=titanic["Survived"], columns=titanic["Sex"])
survived_sex.index =["died", "survived"]
survived_sex

Sex       female  male
died         154   709
survived     308   142

In [9]:
# hayatta kalmak için cinsiyetler arasında bağlantı var mıdır testi
# istersen p-value yorumlayabilirsin ,istersen Chi-square tablo üzerinden gidilebilir.

# H0: Survived ile sex biribirnden bağımsızdır.
# H1: Survived ile sex birbirinden bağımsız değildir.
# p- value oldukça düşük çıktığından dolayı titanic'te birinin hayatta kalmasında cinsiyet etkili bir değişkendir.

chi2, p, dof, expected = stats.chi2_contingency(survived_sex)
results = [
    ['Item', 'Value'],
    ['Chi-Square Test', chi2],
    ['P-Value',p]
]
results

[['Item', 'Value'],
 ['Chi-Square Test', 329.8419924652638],
 ['P-Value', 1.0404030919650888e-73]]

In [11]:
survived_class = pd.crosstab(index=titanic["Survived"], columns=titanic["PClass"])
survived_class.index =["died", "survived"]
survived_class

PClass    1st  2nd  3rd
died      129  160  573
survived  193  119  138

In [13]:
# H0: Survived ile pclass biribirnden bağımsızdır.
# H1: Survived ile pclass birbirinden bağımsız değildir.

# buradan çıkarabileceğimiz sonuç p-value değeri oldukça düşük çıktığından reject to H0 yani sınıf farklılığı 
# insanların hayatta kalması üzerinde etkili bir değişkendir diyebiliriz.

chi2, p, dof, expected = stats.chi2_contingency(survived_class)
results = [
    ['Item', 'Value'],
    ['Chi-Square Test', chi2],
    ['P-Value',p]
]
results

[['Item', 'Value'],
 ['Chi-Square Test', 172.51911553147184],
 ['P-Value', 3.451040459491841e-38]]